HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_i2s.c
void app_i2s_clear_tx_fifo(void)
{
    /* To clear FIFO there is no direct way so Disable and Enable Tx, FIFO will be cleared as a side effect */
    Cy_AudioI2S_DisableTx(TDM_STRUCT0_TX);
    Cy_AudioI2S_EnableTx(TDM_STRUCT0_TX);
    Cy_AudioI2S_DisableTx(TDM_STRUCT0_TX);
}

void app_i2s_activate(void)
{
    /* Activate and enable I2S TX interrupts */
    Cy_AudioTDM_ActivateTx(TDM_STRUCT0_TX);
}

void app_i2s_enable(void)
{
    /* Clear TX interrupts */
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    Cy_AudioTDM_SetTxInterruptMask(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);

    /* Start the I2S TX */
    Cy_AudioTDM_EnableTx(TDM_STRUCT0_TX);
}

void app_i2s_deactivate(void)
{
    /* Deactivate and enable I2S TX interrupts */
    Cy_AudioTDM_DeActivateTx(TDM_STRUCT0_TX);
}

/**
 * RT-Thread Audio Device Driver Interface
 */
static rt_err_t sound_getcaps(struct rt_audio_device *audio, struct rt_audio_caps *caps)
{
    rt_err_t result = RT_EOK;
    struct sound_device *snd_dev;

    RT_ASSERT(audio != RT_NULL);
    snd_dev = (struct sound_device *)audio->parent.user_data;

    switch (caps->main_type)
    {
    case AUDIO_TYPE_QUERY: /* qurey the types of hw_codec device */
    {
        switch (caps->sub_type)
        {
        case AUDIO_TYPE_QUERY:
            // caps->udata.mask = AUDIO_TYPE_OUTPUT | AUDIO_TYPE_MIXER;
            break;

        default:
            result = -RT_ERROR;
            break;
        }

        break;
    }

    case AUDIO_TYPE_OUTPUT: /* Provide capabilities of OUTPUT unit */
    {
        switch (caps->sub_type)
        {
        case AUDIO_DSP_PARAM:
            caps->udata.config.samplerate   = snd_dev->audio_config.samplerate;
            caps->udata.config.channels     = snd_dev->audio_config.channels;
            caps->udata.config.samplebits   = snd_dev->audio_config.samplebits;
            break;

        case AUDIO_DSP_SAMPLERATE:
            caps->udata.config.samplerate   = snd_dev->audio_config.samplerate;
            break;

        case AUDIO_DSP_CHANNELS:
            caps->udata.config.channels     = snd_dev->audio_config.channels;
            break;

        case AUDIO_DSP_SAMPLEBITS:
            caps->udata.config.samplebits   = snd_dev->audio_config.samplebits;
            break;

        default:
            result = -RT_ERROR;
            break;
        }

        break;
    }

    case AUDIO_TYPE_MIXER: /* report the Mixer Units */
    {
        switch (caps->sub_type)
        {
        case AUDIO_MIXER_QUERY:
            caps->udata.mask = AUDIO_MIXER_VOLUME;
            break;

        case AUDIO_MIXER_VOLUME:
            // caps->udata.value =  es8388_volume_get();
            break;

        default:
            result = -RT_ERROR;
            break;
        }

        break;
    }

    default:
        result = -RT_ERROR;
        break;
    }

    return result;
}

static rt_err_t sound_configure(struct rt_audio_device *audio, struct rt_audio_caps *caps)
{
    rt_err_t result = RT_EOK;
    struct sound_device *snd_dev;

    RT_ASSERT(audio != RT_NULL);
    snd_dev = (struct sound_device *)audio->parent.user_data;

    switch (caps->main_type)
    {
    case AUDIO_TYPE_MIXER:
    {
        switch (caps->sub_type)
        {
        case AUDIO_MIXER_VOLUME:
        {
            rt_uint8_t volume = caps->udata.value;
            snd_dev->volume = volume;
            es8388_volume_set(snd_dev->volume);
            LOG_D("set volume %d", volume);
            break;
        }

        default:
            result = -RT_ERROR;
            break;
        }

        break;
    }

    case AUDIO_TYPE_OUTPUT:
    {
        switch (caps->sub_type)
        {
        case AUDIO_DSP_PARAM:
        {
            /* save configs */
            snd_dev->audio_config.samplerate = caps->udata.config.samplerate;
            snd_dev->audio_config.channels   = caps->udata.config.channels;
            snd_dev->audio_config.samplebits = caps->udata.config.samplebits;
            ifx_set_samplerate(snd_dev->audio_config);
            LOG_D("set samplerate %d", snd_dev->audio_config.samplerate);
            break;
        }

        case AUDIO_DSP_SAMPLERATE:
        {
            snd_dev->audio_config.samplerate = caps->udata.config.samplerate;
            ifx_set_samplerate(snd_dev->audio_config);
            LOG_D("set samplerate %d", snd_dev->audio_config.samplerate);
            break;
        }

        case AUDIO_DSP_CHANNELS:
        {
            // SAIA_Channels_Set(caps->udata.config.channels);
            // snd_dev->audio_config.channels   = caps->udata.config.channels;
            // LOG_D("set channels %d", snd_dev->audio_config.channels);
            break;
        }

        case AUDIO_DSP_SAMPLEBITS:
        {
            /* not support */
            // snd_dev->audio_config.samplebits = caps->udata.config.samplebits;
            break;
        }

        default:
            result = -RT_ERROR;
            break;
        }

        break;
    }

    default:
        break;
    }

    return result;
}

static rt_err_t sound_init(struct rt_audio_device *audio)
{
    rt_err_t result = RT_EOK;

    struct sound_device *snd_dev;

    RT_ASSERT(audio != RT_NULL);

    snd_dev = (struct sound_device *)audio->parent.user_data;

    result = ifx_i2s_init();
    if (result != RT_EOK)
    {
        LOG_E("I2S init failed, sound0 open aborted.");
        return result;
    }

    if (es8388_init("i2c0", RT_NULL) != RT_EOK)
    {
        LOG_E("ES8388 init failed.");
        return -RT_ERROR;
    }

    es8388_start(ES_MODE_DAC);

    es8388_volume_set(20);
    ifx_set_samplerate(snd_dev->audio_config);

    rt_thread_startup(snd_dev->playback_thread);

    LOG_I("ES8388 init success.");
    return result;
}

static rt_err_t sound_start(struct rt_audio_device *audio, int stream)
{
    RT_ASSERT(audio != RT_NULL);

    if (stream == AUDIO_STREAM_REPLAY)
    {
        music_player_active = true;
        LOG_I("Ready for I2S output \r\n");
        rt_audio_tx_complete(audio);
    }

