HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_i2s.c
        asrc_out_len = ASRC_OUTPUT_BUFFER_SIZE;
        asrc_out_ptr = asrc_out_aec_ref_buffer_32bit;
        frame_out_buffer = asrc_out_aec_ref_buffer_16bit;
        /* IFX_asrc() called 2 times to pass the samples */
        for (rt_uint32_t i = 0; i < ASRC_NUM_ITERATIONS_PER_FRAME; i++)
        {
            if (SAMPLING_RATE_48kHz == SAMPLING_RATE)
            {
                IFX_asrc(asrc_in_i2s_playback_buffer_32bit +
                         ASRC_INPUT_SAMPLES * i, ASRC_INPUT_SAMPLES,
                         asrc_out_ptr, &asrc_out_len, &asrc_mem_down_sampling);
            }
            if (SAMPLING_RATE_44_1kHz == SAMPLING_RATE)
            {
                if ((ASRC_NUM_ITERATIONS_PER_FRAME - 1) != i)
                {
                    IFX_asrc(asrc_in_i2s_playback_buffer_32bit +
                             ASRC_INPUT_SAMPLES * i, ASRC_INPUT_SAMPLES,
                             asrc_out_ptr, &asrc_out_len, &asrc_mem_down_sampling);
                }
                else
                {
                    IFX_asrc(asrc_in_i2s_playback_buffer_32bit +
                             ASRC_INPUT_SAMPLES * i, (FRAME_SIZE - ASRC_INPUT_SAMPLES),
                             asrc_out_ptr, &asrc_out_len, &asrc_mem_down_sampling);
                }
            }
            /* Convert int32_t to int16_t */
            for (rt_uint32_t j = 0; j < asrc_out_len; j++)
            {
                *(frame_out_buffer++) = (int16_t)(*(asrc_out_ptr + j));
            }
            asrc_out_ptr += asrc_out_len;
        }

#endif

        /* Only for the first frame, push the AEC reference data from the task. */

        /* Wait for notification from I2S ISR for completion of previous
         * audio frame playback.
         */
        if (!first_frame && !i2s_deinit_flag)
        {
            rt_sem_take(snd_dev->tx_sem, RT_WAITING_FOREVER);
        }

        /* Reset first frame flag. */
        first_frame = false;
        while (audio->replay->queue.is_empty == 1)
        {
            rt_thread_mdelay(1);
#if defined(PKG_USING_WAVPLAYER) && !defined(BSP_USING_XiaoZhi)
            if(count>=50){
                rt_completion_done(&audio->replay->cmp);
                count=0;
            }
            count++;
#endif
        }
        rt_audio_tx_complete(audio);
    }
}


bool is_music_player_active(void)
{
    return music_player_active;
}

bool is_music_player_paused(void)
{
    return music_player_pause;
}

void i2s_tx_interrupt_handler(void)
{
    rt_interrupt_enter();

    /* Get interrupt status and check for tigger interrupt and errors */
    rt_uint32_t intr_status = Cy_AudioTDM_GetTxInterruptStatusMasked(TDM_STRUCT0_TX);

    if (CY_TDM_INTR_TX_FIFO_TRIGGER & intr_status)
    {
        if (((PLAYBACK_DATA_FRAME_SIZE / HW_FIFO_SIZE) + 1) == i2s_32_samples_frame_count)
        {
            /* When 5 frames of the data is written into I2S call 10msec frame handlling() */
            {
                // music_player_q_data_t music_player_q_data;

                /* Initially, set the I2S playback and AEC reference to zero buffers. */
                int16_t *aec_ref_temp_ptr = aec_ref_cb_ptr;
                aec_ref_cb_ptr = aec_ref_zero_buffer;

                /* Set the I2S playback and AEC reference pointers to actual data in case
                * the data is ready and audio playback is active.
                */
                if ((!i2s_deinit_flag && i2s_data_ready_flag) ||
                        (first_frame))
                {
                    i2s_data_ready_flag = false;
                    i2s_playback_ptr = active_i2s_playback_buffer_ptr;
                    aec_ref_cb_ptr = aec_ref_temp_ptr;
                }

                /* Unless deinitialized, play the data over I2S and send the corresponding
                * AEC reference pointer to the AEC reference queue.
                */
                if (!i2s_deinit_flag)
                {
                    i2s_write_32_samples();
                }

                /* If the non-zero data is played, notify the I2S task for processing of
                * playback data of next frames.
                */
                if ((i2s_playback_ptr == active_i2s_playback_buffer_ptr))
                {
                    rt_sem_release(snd_dev.tx_sem);
                }
            }
        }
        else
        {
            if (is_music_player_paused() || i2s_data_ready_flag == false)
            {
                g_i2s_tx_zero_fill_count++;
                for (int i = 0; i < HW_FIFO_SIZE; i++)
                {
                    /* Write same data for L,R channels(dual mono) in FIFO */
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) 0);
                    i++;
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) 0);
                }
            }
            else
            {
                g_i2s_tx_frame_ready_count++;
                for (int i = 0; i < HW_FIFO_SIZE; i++)
                {
                    /* Write same data for L,R channels(dual mono) in FIFO */
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) * ((i2s_playback_ptr + (HW_FIFO_SIZE * (i2s_32_samples_frame_count - 1))) + i));
                    i++;
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) * ((i2s_playback_ptr + (HW_FIFO_SIZE * (i2s_32_samples_frame_count - 1))) + i));
                }
                i2s_32_samples_frame_count++;
            }

        }
    }
    else if (CY_TDM_INTR_TX_FIFO_UNDERFLOW & intr_status)
    {
        g_i2s_tx_underflow_count++;
        rt_kprintf("Error: I2S transmit underflowed\r\n");
    }

    /* Clear all Tx I2S Interrupt */
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);

    rt_interrupt_leave();
}

uint32_t ifx_i2s_tx_underflow_count(void)
{
    return g_i2s_tx_underflow_count;
}

uint32_t ifx_i2s_tx_zero_fill_count(void)
{
    return g_i2s_tx_zero_fill_count;
}

uint32_t ifx_i2s_tx_frame_ready_count(void)
{
    return g_i2s_tx_frame_ready_count;
}
